# ExportLineweightTable Properties

---
The ExportLineweightTable type exposes the following members.
| Name| Description
---|---|---
| Count|  Count of the items contained in the collection.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Item|  A copy of the ExportLineweightInfo for the line weight's ExportLineweightKey.
Top
#### Reference
ExportLineweightTable Class
Autodesk.Revit.DB Namespace